import * as Yup from "yup";

const userNameExp=/^[a-zA-Z][a-zA-Z0-9-_\.]{1,25}$/
const passwordRegExp=/(?=^.{8,}$)((?=.*\d)|(?=.*\W+))(?![.\n])(?=.*[A-Z])(?=.*[a-z]).*$/
const phoneRegExp = /^((\\+[1-9]{1,4}[ \\-]*)|(\\([0-9]{2,3}\\)[ \\-]*)|([0-9]{2,4})[ \\-]*)*?[0-9]{3,4}?[ \\-]*[0-9]{3,4}?$/
const emailRegExp = /^(([^<>()[\].,;:\s@"]+(\.[^<>()[\].,;:\s@"]+)*)|(".+"))@(([^<>()[\].,;:\s@"]+\.)+[^<>()[\].,;:\s@"]{2,})$/
const dateRegExp=/^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]))\1|(?:(?:29|30)(\/|-|\.)(?:0?[1,3-9]|1[0-2])\2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)0?2\3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9])|(?:1[0-2]))\4(?:(?:1[6-9]|[2-9]\d)?\d{2})$/

export const signInSchema = Yup.object({
  userName: Yup.string()
    .matches(userNameExp, "Введите имя пользователя от 2 до 20 символов, только латинские буквы и цифры.")
    .required("Поле обязательно!")
    .max(25, "Максимальная длина - 25 символов"),
  password: Yup.string()
    .matches(passwordRegExp, "Введите пароль от 8 символов. Строчные и прописные латинские буквы, цифры, спецсимволы.")
    .required("Поле обязательно!")
    .min(3, "Пароль слишком короткий - минимум 3 символа")
    .max(50, "Максимальная длина - 50 символов"),
});

export const signUpSchema = Yup.object({
  userName: Yup.string()
    .matches(userNameExp, "Введите имя пользователя от 2 до 20 символов, только латинские буквы и цифры.")
    .required("Поле обязательно!")
    .min(2, "Минимальная длина - 2 символа")
    .max(20, "Максимальная длина - 20 символов"),
  password: Yup.string()
    .matches(passwordRegExp, "Введите пароль от 8 символов. Строчные и прописные латинские буквы, цифры, спецсимволы.")
    .required("Поле обязательно!")
    .min(3, "Пароль слишком короткий - минимум 8 символа"),
  email: Yup.string()
    .matches(emailRegExp, "Введите электронную почту в формате email@mail.domen.")
    .required("Поле обязательно!")
    .typeError("Неверный формат уэлектронной почты"),
  phone: Yup.string()
    .matches(phoneRegExp, "Введите номер телефона в формате 8**********.")
    .required("Поле обязательно!")
    .typeError("Неверный формат номера телефона!"),
  date: Yup.string()
    .matches(dateRegExp, "Введите дату рождения в формате ДД.ММ.ГГГГ.")
    .required("Поле обязательно!")
    .typeError("Неверный формат даты рождения"),
});
